//
//  nav.hsla.cpp
//
//  Created by BernieZhao on 2024/8/5.
//

#include "mbgl/nav/nav.address.hpp"


namespace nav {

namespace place {

size_t index = 0;

const std::vector<mbgl::CameraOptions> places = {

    // streetscape
    { mbgl::LatLng { 40.707262, -74.010276 }, {}, {}, 15.317721, 86.724884, 52.573314 }, // 纽约金融街
    { mbgl::LatLng { 22.301229, 114.165590 }, {}, {}, 15.722247, 33.540795, 66.467114 }, // 香港维多利亚
    { mbgl::LatLng { 39.903813, 116.391290 }, {}, {}, 17.065933, -36.393703, 65.826275 }, // 北京天安门广场
    { mbgl::LatLng { 31.240378, 121.490911 }, {}, {}, 15.445918, 59.685314, 80.555060 }, // 上海外滩
    { mbgl::LatLng { 25.034055, 121.564515 }, {}, {}, 16.077729, 143.526270, 70.723858 }, // 台北101
    { mbgl::LatLng { 3.157823, 101.711731 }, {}, {}, 16.335255, -38.003147, 57.806744 }, // 吉隆坡双子塔
    { mbgl::LatLng { 25.191752, 55.274737 }, {}, {}, 15.491167, -33.053848, 71.050945 }, // 迪拜哈利法塔
    { mbgl::LatLng { 25.129851, 55.132237 }, {}, {}, 15.150993, 177.527160, 67.077923 }, // 迪拜棕榈岛
    { mbgl::LatLng { 55.751530, 37.616234 }, {}, {}, 17.067929, 117.753539, 61.280804 }, // 莫斯科克林姆林宫
    { mbgl::LatLng { 50.088628, 14.415480 }, {}, {}, 16.215369, 103.655584, 70 }, // 布拉格广场
    { mbgl::LatLng { 41.889696, 12.491829 }, {}, {}, 17.483347, 50.031478, 67.692608 }, // 罗马斗兽场
    { mbgl::LatLng { 48.859349, 2.295866 }, {}, {}, 15.342488, -69.429364, 71.050945 }, // 巴黎埃菲尔铁塔
    { mbgl::LatLng { 51.500114, -0.125438 }, {}, {}, 17.143774, -103.796666, 44.830456 }, // 伦敦大本钟
    
    // ocean
    { mbgl::LatLng { 35.884921, 138.527952 }, {}, {}, 7.137733, 0, 0 },
    { mbgl::LatLng { 31.217935, 120.949375 }, {}, {}, 9.145968, 0, 0 },
    { mbgl::LatLng { 22.670898, 115.953376 }, {}, {}, 5.778833, 0, 0 },
    { mbgl::LatLng { 51.501716, -0.080117 }, {}, {}, 10.320973, 0, 0 },
    { mbgl::LatLng { 40.709430, -74.027215 }, {}, {}, 11.335746, 0, 0 },

};

const mbgl::CameraOptions& current() {
    return places[0];
}

const mbgl::CameraOptions& next() {
    index = (index + 1) % places.size();
    return places[index];
}

}



}
