//
//  nav.hsla.cpp
//
//  Created by BernieZhao on 2024/8/5.
//

#include "mbgl/nav/nav.address.hpp"


namespace nav {

namespace place {

size_t index = 0;

const std::vector<mbgl::CameraOptions> places = {

    // streetscape
    { mbgl::LatLng { 22.294522, 114.157209 }, {}, {}, 15.722247, 71.050945, 147.869345 }, // 香港维多利亚
    { mbgl::LatLng { 39.903563, 116.391363 }, {}, {}, 17.141364, 70.103668, -33.081634 }, // 北京天安门广场
    { mbgl::LatLng { 31.242662, 121.495084 }, {}, {}, 15.445918, 71.050945, -179.947701 }, // 上海外滩
    { mbgl::LatLng { 25.034055, 121.564515 }, {}, {}, 16.077729, 70.723858, 143.526270 }, // 台北101
    { mbgl::LatLng { 3.157823, 101.711731 }, {}, {}, 16.335255, 57.806744, -38.003147 }, // 吉隆坡双子塔
    { mbgl::LatLng { 25.191752, 55.274737 }, {}, {}, 15.491167, 71.050945, -33.053848 }, // 迪拜哈利法塔
    { mbgl::LatLng { 25.129851, 55.132237 }, {}, {}, 15.150993, 67.077923, 177.527160 }, // 迪拜棕榈岛
    { mbgl::LatLng { 55.751815, 37.621716 }, {}, {}, 17.575426, 70.000000, -157.404684 }, // 莫斯科红场
    { mbgl::LatLng { 50.087501, 14.421360 }, {}, {}, 16.215369, 70, 103.655584 }, // 布拉格广场
    { mbgl::LatLng { 41.889696, 12.491829 }, {}, {}, 17.483347, 67.692608, 50.031478 }, // 罗马斗兽场
    { mbgl::LatLng { 48.859491, 2.293157 }, {}, {}, 16.341660, 71.050945, 117.451230 }, // 巴黎埃菲尔铁塔
    { mbgl::LatLng { 51.500735, -0.124490 }, {}, {}, 17.808440, 71.050945, -141.514926 }, // 伦敦大本钟
    { mbgl::LatLng { 40.708050, -74.010099 }, {}, {}, 15.317721, 71.050945, 34.123000 }, // 纽约金融街
    
    // ocean
    { mbgl::LatLng { 35.884921, 138.527952 }, {}, {}, 7.137733, 0, 0 },
    { mbgl::LatLng { 31.217935, 120.949375 }, {}, {}, 9.145968, 0, 0 },
    { mbgl::LatLng { 22.670898, 115.953376 }, {}, {}, 5.778833, 0, 0 },
    { mbgl::LatLng { 51.501716, -0.080117 }, {}, {}, 10.320973, 0, 0 },
    { mbgl::LatLng { 40.709430, -74.027215 }, {}, {}, 11.335746, 0, 0 },

};

const mbgl::CameraOptions& start() {
    return places[0];
}

const mbgl::CameraOptions& current() {
    return places[index];
}

void next() {
    index = index++ % places.size();
}

}



}
